```
2025-07-13T19:59:30.263+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Server=pve-api-daemon/3.0 tf_http_res_status_reason="200 OK" tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_http_res_body="{\"data\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\"}" Content-Length=74 Content-Type=application/json;charset=UTF-8 Pragma=no-cache tf_provider_addr=registry.terraform.io/bpg/proxmox tf_rpc=ApplyResourceChange @module=proxmox Cache-Control=max-age=0 Expires="Sun, 13 Jul 2025 14:29:30 GMT" tf_http_res_status_code=200 tf_http_trans_id=e28f712a-8cbf-a257-b7ca-12a40afaca55 Date="Sun, 13 Jul 2025 14:29:30 GMT" tf_http_op_type=response tf_http_res_version=HTTP/1.1 tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm timestamp="2025-07-13T19:59:30.263+0530"
2025-07-13T19:59:30.264+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: Accept=application/json Accept-Encoding=gzip Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_method=GET tf_http_req_version=HTTP/1.1 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_http_op_type=request tf_provider_addr=registry.terraform.io/bpg/proxmox tf_resource_type=proxmox_virtual_environment_vm @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox Host=10.0.0.4:8006 tf_http_req_body="" tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_http_trans_id=eb7671f3-d2eb-799f-71d6-6727b8a9daa6 tf_mux_provider=tf5to6server.v5tov6Server User-Agent=Go-http-client/1.1 tf_rpc=ApplyResourceChange timestamp="2025-07-13T19:59:30.264+0530"
2025-07-13T19:59:30.424+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Content-Type=application/json;charset=UTF-8 tf_http_trans_id=eb7671f3-d2eb-799f-71d6-6727b8a9daa6 tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 Cache-Control=max-age=0 Pragma=no-cache tf_http_op_type=response tf_http_res_body="{\"data\":{\"status\":\"running\",\"node\":\"proxmox\",\"starttime\":1752416970,\"pstart\":1261418,\"type\":\"qmreboot\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"pid\":402452,\"id\":\"9100\",\"user\":\"root@pam\"}}" tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" tf_resource_type=proxmox_virtual_environment_vm Date="Sun, 13 Jul 2025 14:29:30 GMT" tf_http_res_version=HTTP/1.1 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Expires="Sun, 13 Jul 2025 14:29:30 GMT" Server=pve-api-daemon/3.0 tf_rpc=ApplyResourceChange @module=proxmox Content-Length=220 timestamp="2025-07-13T19:59:30.424+0530"
2025-07-13T19:59:31.425+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: Host=10.0.0.4:8006 User-Agent=Go-http-client/1.1 tf_http_op_type=request tf_http_req_body="" tf_http_req_version=HTTP/1.1 tf_http_req_method=GET tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox Accept-Encoding=gzip Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_trans_id=eece3b1e-3e21-74e4-32b3-b508c10d6717 tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 Accept=application/json tf_mux_provider=tf5to6server.v5tov6Server timestamp="2025-07-13T19:59:31.425+0530"
2025-07-13T19:59:31.591+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox tf_http_op_type=response tf_http_res_body="{\"data\":{\"status\":\"running\",\"node\":\"proxmox\",\"starttime\":1752416970,\"pstart\":1261418,\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"pid\":402452,\"id\":\"9100\",\"user\":\"root@pam\"}}" tf_http_res_version=HTTP/1.1 tf_http_trans_id=eece3b1e-3e21-74e4-32b3-b508c10d6717 Content-Length=220 Date="Sun, 13 Jul 2025 14:29:31 GMT" Expires="Sun, 13 Jul 2025 14:29:31 GMT" tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox Content-Type=application/json;charset=UTF-8 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange Cache-Control=max-age=0 Pragma=no-cache Server=pve-api-daemon/3.0 timestamp="2025-07-13T19:59:31.590+0530"
2025-07-13T19:59:32.592+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: Accept=application/json User-Agent=Go-http-client/1.1 tf_http_req_body="" tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm @module=proxmox Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_method=GET tf_provider_addr=registry.terraform.io/bpg/proxmox Accept-Encoding=gzip Host=10.0.0.4:8006 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 tf_http_op_type=request tf_http_req_version=HTTP/1.1 tf_http_trans_id=8ab5b193-4af6-6cba-d810-66b0d5fa0e38 tf_rpc=ApplyResourceChange timestamp="2025-07-13T19:59:32.591+0530"
2025-07-13T19:59:32.757+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: tf_rpc=ApplyResourceChange Content-Length=220 Pragma=no-cache tf_http_op_type=response tf_http_trans_id=8ab5b193-4af6-6cba-d810-66b0d5fa0e38 tf_http_res_version=HTTP/1.1 tf_provider_addr=registry.terraform.io/bpg/proxmox tf_resource_type=proxmox_virtual_environment_vm Content-Type=application/json;charset=UTF-8 tf_http_res_body="{\"data\":{\"type\":\"qmreboot\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"user\":\"root@pam\",\"pid\":402452,\"id\":\"9100\",\"pstart\":1261418,\"starttime\":1752416970,\"node\":\"proxmox\",\"status\":\"running\"}}" tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox Cache-Control=max-age=0 Date="Sun, 13 Jul 2025 14:29:32 GMT" Expires="Sun, 13 Jul 2025 14:29:32 GMT" Server=pve-api-daemon/3.0 tf_mux_provider=tf5to6server.v5tov6Server timestamp="2025-07-13T19:59:32.756+0530"
2025-07-13T19:59:33.759+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_op_type=request Accept-Encoding=gzip tf_http_req_method=GET tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm @module=proxmox tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_provider_addr=registry.terraform.io/bpg/proxmox tf_rpc=ApplyResourceChange Accept=application/json Host=10.0.0.4:8006 User-Agent=Go-http-client/1.1 tf_http_req_body="" tf_http_req_version=HTTP/1.1 tf_http_trans_id=49f39b11-946a-ead7-94fb-76b5040f61a1 timestamp="2025-07-13T19:59:33.758+0530"
2025-07-13T19:59:33.918+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox Content-Length=220 Server=pve-api-daemon/3.0 tf_provider_addr=registry.terraform.io/bpg/proxmox Content-Type=application/json;charset=UTF-8 tf_http_op_type=response tf_http_trans_id=49f39b11-946a-ead7-94fb-76b5040f61a1 Cache-Control=max-age=0 Date="Sun, 13 Jul 2025 14:29:33 GMT" Expires="Sun, 13 Jul 2025 14:29:33 GMT" Pragma=no-cache tf_http_res_body="{\"data\":{\"node\":\"proxmox\",\"starttime\":1752416970,\"status\":\"running\",\"pid\":402452,\"id\":\"9100\",\"user\":\"root@pam\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"pstart\":1261418}}" tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" tf_http_res_version=HTTP/1.1 timestamp="2025-07-13T19:59:33.918+0530"
2025-07-13T19:59:34.919+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: tf_http_req_version=HTTP/1.1 tf_rpc=ApplyResourceChange Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_body="" tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status Accept=application/json User-Agent=Go-http-client/1.1 tf_http_trans_id=05ce01ab-6e96-a1ef-6caf-d7c5f60bab0d tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Host=10.0.0.4:8006 tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 @module=proxmox Accept-Encoding=gzip tf_http_op_type=request tf_http_req_method=GET timestamp="2025-07-13T19:59:34.919+0530"
2025-07-13T19:59:35.085+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Content-Type=application/json;charset=UTF-8 Expires="Sun, 13 Jul 2025 14:29:35 GMT" Server=pve-api-daemon/3.0 tf_http_res_status_reason="200 OK" tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange Date="Sun, 13 Jul 2025 14:29:35 GMT" tf_http_op_type=response tf_http_res_body="{\"data\":{\"status\":\"running\",\"starttime\":1752416970,\"node\":\"proxmox\",\"pstart\":1261418,\"user\":\"root@pam\",\"pid\":402452,\"id\":\"9100\",\"type\":\"qmreboot\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\"}}" tf_http_trans_id=05ce01ab-6e96-a1ef-6caf-d7c5f60bab0d @module=proxmox Content-Length=220 tf_http_res_status_code=200 tf_http_res_version=HTTP/1.1 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cache-Control=max-age=0 Pragma=no-cache tf_provider_addr=registry.terraform.io/bpg/proxmox timestamp="2025-07-13T19:59:35.085+0530"
2025-07-13T19:59:36.087+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox Host=10.0.0.4:8006 tf_resource_type=proxmox_virtual_environment_vm @module=proxmox Accept=application/json User-Agent=Go-http-client/1.1 tf_http_op_type=request tf_http_req_body="" tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_http_req_version=HTTP/1.1 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Accept-Encoding=gzip Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_method=GET tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_rpc=ApplyResourceChange tf_http_trans_id=1ad62c07-4618-593f-165d-77bedf96c421 timestamp="2025-07-13T19:59:36.087+0530"
2025-07-13T19:59:36.248+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: tf_http_res_version=HTTP/1.1 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm @module=proxmox Content-Length=220 tf_http_op_type=response tf_provider_addr=registry.terraform.io/bpg/proxmox tf_rpc=ApplyResourceChange Cache-Control=max-age=0 Expires="Sun, 13 Jul 2025 14:29:36 GMT" tf_http_trans_id=1ad62c07-4618-593f-165d-77bedf96c421 @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Content-Type=application/json;charset=UTF-8 Date="Sun, 13 Jul 2025 14:29:36 GMT" Pragma=no-cache tf_http_res_body="{\"data\":{\"node\":\"proxmox\",\"starttime\":1752416970,\"status\":\"running\",\"id\":\"9100\",\"pid\":402452,\"user\":\"root@pam\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"pstart\":1261418}}" tf_mux_provider=tf5to6server.v5tov6Server Server=pve-api-daemon/3.0 tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" timestamp="2025-07-13T19:59:36.248+0530"
2025-07-13T19:59:37.249+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_http_req_version=HTTP/1.1 tf_provider_addr=registry.terraform.io/bpg/proxmox @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 User-Agent=Go-http-client/1.1 tf_http_op_type=request tf_http_req_method=GET tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange @module=proxmox Accept=application/json Host=10.0.0.4:8006 tf_mux_provider=tf5to6server.v5tov6Server tf_http_trans_id=4f0d72a2-bd8c-9203-43d9-a490e762597e tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 Accept-Encoding=gzip Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_body="" timestamp="2025-07-13T19:59:37.249+0530"
2025-07-13T19:59:37.412+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Date="Sun, 13 Jul 2025 14:29:37 GMT" tf_http_res_version=HTTP/1.1 tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm Pragma=no-cache tf_http_op_type=response @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cache-Control=max-age=0 Server=pve-api-daemon/3.0 tf_http_res_body="{\"data\":{\"status\":\"running\",\"starttime\":1752416970,\"node\":\"proxmox\",\"pstart\":1261418,\"user\":\"root@pam\",\"id\":\"9100\",\"pid\":402452,\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\"}}" tf_http_trans_id=4f0d72a2-bd8c-9203-43d9-a490e762597e tf_rpc=ApplyResourceChange @module=proxmox Content-Type=application/json;charset=UTF-8 Expires="Sun, 13 Jul 2025 14:29:37 GMT" tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" Content-Length=220 timestamp="2025-07-13T19:59:37.411+0530"
2025-07-13T19:59:38.413+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: tf_http_trans_id=47eeb09e-248f-4410-5a42-18baab65286d tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 Accept-Encoding=gzip User-Agent=Go-http-client/1.1 tf_mux_provider=tf5to6server.v5tov6Server @module=proxmox Accept=application/json tf_http_req_version=HTTP/1.1 tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" Host=10.0.0.4:8006 tf_http_op_type=request tf_http_req_body="" tf_http_req_method=GET tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status timestamp="2025-07-13T19:59:38.412+0530"
2025-07-13T19:59:38.572+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Pragma=no-cache @module=proxmox Cache-Control=max-age=0 Content-Length=220 Content-Type=application/json;charset=UTF-8 Server=pve-api-daemon/3.0 tf_http_res_body="{\"data\":{\"node\":\"proxmox\",\"starttime\":1752416970,\"status\":\"running\",\"pid\":402452,\"id\":\"9100\",\"user\":\"root@pam\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"pstart\":1261418}}" tf_http_res_status_code=200 tf_http_trans_id=47eeb09e-248f-4410-5a42-18baab65286d tf_http_op_type=response tf_http_res_status_reason="200 OK" tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox tf_rpc=ApplyResourceChange tf_http_res_version=HTTP/1.1 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Date="Sun, 13 Jul 2025 14:29:38 GMT" Expires="Sun, 13 Jul 2025 14:29:38 GMT" timestamp="2025-07-13T19:59:38.572+0530"
module.prod_resources.module.base.proxmox_virtual_environment_vm.vm["9100"]: Still creating... [00m20s elapsed]
2025-07-13T19:59:39.573+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Accept-Encoding=gzip Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" Host=10.0.0.4:8006 tf_http_op_type=request tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_provider_addr=registry.terraform.io/bpg/proxmox tf_resource_type=proxmox_virtual_environment_vm @module=proxmox Accept=application/json User-Agent=Go-http-client/1.1 tf_http_trans_id=f1530ba7-0e6c-af4a-8e78-8bd1ab0eefb2 tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_http_req_body="" tf_http_req_method=GET tf_http_req_version=HTTP/1.1 tf_rpc=ApplyResourceChange timestamp="2025-07-13T19:59:39.573+0530"
2025-07-13T19:59:39.735+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: @module=proxmox Cache-Control=max-age=0 Expires="Sun, 13 Jul 2025 14:29:39 GMT" tf_http_res_status_code=200 tf_mux_provider=tf5to6server.v5tov6Server Date="Sun, 13 Jul 2025 14:29:39 GMT" tf_http_res_status_reason="200 OK" tf_rpc=ApplyResourceChange @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Pragma=no-cache tf_http_res_body="{\"data\":{\"status\":\"running\",\"starttime\":1752416970,\"node\":\"proxmox\",\"pstart\":1261418,\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"user\":\"root@pam\",\"id\":\"9100\",\"pid\":402452}}" tf_http_res_version=HTTP/1.1 tf_provider_addr=registry.terraform.io/bpg/proxmox Content-Length=220 Content-Type=application/json;charset=UTF-8 Server=pve-api-daemon/3.0 tf_http_op_type=response tf_http_trans_id=f1530ba7-0e6c-af4a-8e78-8bd1ab0eefb2 tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm timestamp="2025-07-13T19:59:39.734+0530"
2025-07-13T19:59:40.736+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Host=10.0.0.4:8006 tf_http_req_body="" tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status tf_mux_provider=tf5to6server.v5tov6Server tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_rpc=ApplyResourceChange @module=proxmox Accept-Encoding=gzip tf_http_op_type=request tf_http_trans_id=add00910-aff5-b978-b271-351465c0bbd0 tf_resource_type=proxmox_virtual_environment_vm Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_http_req_version=HTTP/1.1 Accept=application/json User-Agent=Go-http-client/1.1 tf_http_req_method=GET timestamp="2025-07-13T19:59:40.735+0530"
2025-07-13T19:59:40.897+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Expires="Sun, 13 Jul 2025 14:29:40 GMT" Server=pve-api-daemon/3.0 tf_provider_addr=registry.terraform.io/bpg/proxmox @module=proxmox Content-Type=application/json;charset=UTF-8 tf_http_res_version=HTTP/1.1 tf_http_trans_id=add00910-aff5-b978-b271-351465c0bbd0 tf_mux_provider=tf5to6server.v5tov6Server tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_rpc=ApplyResourceChange Date="Sun, 13 Jul 2025 14:29:40 GMT" Pragma=no-cache tf_http_res_body="{\"data\":{\"status\":\"running\",\"starttime\":1752416970,\"node\":\"proxmox\",\"pstart\":1261418,\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"user\":\"root@pam\",\"pid\":402452,\"id\":\"9100\"}}" tf_http_res_status_code=200 tf_resource_type=proxmox_virtual_environment_vm @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cache-Control=max-age=0 Content-Length=220 tf_http_op_type=response tf_http_res_status_reason="200 OK" timestamp="2025-07-13T19:59:40.897+0530"
2025-07-13T19:59:41.899+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 @module=proxmox Accept=application/json tf_http_req_body="" Accept-Encoding=gzip Host=10.0.0.4:8006 tf_http_op_type=request tf_http_trans_id=4dfaee7e-9a2e-5959-2339-a52a8b785660 tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm tf_rpc=ApplyResourceChange User-Agent=Go-http-client/1.1 tf_http_req_method=GET tf_http_req_version=HTTP/1.1 tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 timestamp="2025-07-13T19:59:41.899+0530"
2025-07-13T19:59:42.060+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 tf_resource_type=proxmox_virtual_environment_vm Date="Sun, 13 Jul 2025 14:29:42 GMT" tf_rpc=ApplyResourceChange @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Content-Length=220 Content-Type=application/json;charset=UTF-8 Server=pve-api-daemon/3.0 tf_http_res_status_code=200 tf_http_res_status_reason="200 OK" @module=proxmox Cache-Control=max-age=0 tf_http_op_type=response tf_http_res_body="{\"data\":{\"status\":\"running\",\"node\":\"proxmox\",\"starttime\":1752416970,\"pstart\":1261418,\"pid\":402452,\"id\":\"9100\",\"user\":\"root@pam\",\"type\":\"qmreboot\",\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\"}}" tf_http_res_version=HTTP/1.1 tf_http_trans_id=4dfaee7e-9a2e-5959-2339-a52a8b785660 Expires="Sun, 13 Jul 2025 14:29:42 GMT" Pragma=no-cache tf_mux_provider=tf5to6server.v5tov6Server timestamp="2025-07-13T19:59:42.060+0530"
2025-07-13T19:59:43.061+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Sending HTTP Request: tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm tf_http_req_uri=/api2/json/nodes/proxmox/tasks/UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:/status @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Host=10.0.0.4:8006 User-Agent=Go-http-client/1.1 Cookie="PVEAuthCookie=PVE:root@pam:6873C2BF::BdDA0HgjRXA29gAQGsd/ekSStDX+WCHAp4YZYDrMG0/xRHNpdBKlKFxNLaqNt+LCRk+rMD/1RCLX17hVB08uyeMVCDLzLyAVitwqN77LX9mSndjHY3HJKIAAxBPF/aLVr+jZoHI7I5g2XuapJfAKcLJ0WITOHzPW7wf+ook8Mqg2alEVtCVU8OYagHMAxexEXDT+FsyaocEVAb5VIxSSgydL34aIFx29OMv5swU8mIC00i9O9xgZAs5nALIelTKb+OezS/+Nr4qxRb0c8lfUil3HAOTzvAYGadCrdNwHjcDOMtwmC44GGSYe8iKuHm/BL34mOauo3g+pjlXx4bcJBg==" tf_rpc=ApplyResourceChange Accept=application/json tf_http_req_body="" tf_http_req_method=GET tf_http_req_version=HTTP/1.1 tf_http_trans_id=7122a52b-71cf-c5d3-2a23-38ef7f29964c tf_provider_addr=registry.terraform.io/bpg/proxmox tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 @module=proxmox Accept-Encoding=gzip tf_http_op_type=request timestamp="2025-07-13T19:59:43.061+0530"
2025-07-13T19:59:43.236+0530 [DEBUG] provider.terraform-provider-proxmox_v0.79.0: Received HTTP Response: Content-Type=application/json;charset=UTF-8 Pragma=no-cache Server=pve-api-daemon/3.0 tf_http_res_status_code=200 tf_http_res_version=HTTP/1.1 tf_provider_addr=registry.terraform.io/bpg/proxmox tf_http_op_type=response tf_rpc=ApplyResourceChange tf_http_res_body="{\"data\":{\"upid\":\"UPID:proxmox:00062414:00133F6A:6873C2CA:qmreboot:9100:root@pam:\",\"type\":\"qmreboot\",\"id\":\"9100\",\"exitstatus\":\"received interrupt\",\"pid\":402452,\"user\":\"root@pam\",\"pstart\":1261418,\"node\":\"proxmox\",\"starttime\":1752416970,\"status\":\"stopped\"}}" @caller=/home/runner/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/logging/logging_http_transport.go:162 Cache-Control=max-age=0 Expires="Sun, 13 Jul 2025 14:29:43 GMT" tf_http_res_status_reason="200 OK" tf_mux_provider=tf5to6server.v5tov6Server tf_resource_type=proxmox_virtual_environment_vm Content-Length=254 Date="Sun, 13 Jul 2025 14:29:43 GMT" tf_http_trans_id=7122a52b-71cf-c5d3-2a23-38ef7f29964c tf_req_id=af8a705c-2e37-c98c-cde7-52b99eaccdd5 @module=proxmox timestamp="2025-07-13T19:59:43.236+0530"

```

the last few lines of log where it gets stuck. i aborted the reboot operation in proxmox after this.

Below is my config for VM
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.prod_resources.module.base.proxmox_virtual_environment_vm.vm["9100"] will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "ovmf"
      + description             = "optional(string)       # The description (Managed by Terraform)"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "nixtest"
      + network_interface_names = (known after apply)
      + node_name               = "proxmox"
      + on_boot                 = true
      + protection              = false
      + reboot                  = true
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "test",
          + "testVM",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 9100
        # (1 unchanged attribute hidden)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = true
          + type    = "virtio"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + import_from       = "local:import/nixos_25.11.qcow2"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = true
        }

      + efi_disk {
          + datastore_id      = "local-lvm"
          + file_format       = (known after apply)
          + pre_enrolled_keys = false
          + type              = "2m"
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + dns {
              + domain  = "<redacter>"
              + servers = [
                  + "<redacted>",
                ]
            }

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys = [
                  + "ssh-ed25519 <redacted>",
                  + "ssh-ed25519 <redacted>",
                ]
            }
        }

      + memory {
          + dedicated      = 2048
          + floating       = 2048
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 1
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + rng {
          + max_bytes = (known after apply)
          + period    = (known after apply)
          + source    = "/dev/urandom"
        }

      + tpm_state {
          + datastore_id = "local-lvm"
          + version      = "v2.0"
        }

      + vga (known after apply)

    }

```